mrtoy-me/ESP32_SMA-Inverter-MQTT/src/ESP32_SMA_MQTT.cpp
/* MIT License

Copyright (c) 2023 darrylb123

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/
// Wifi Functions choose between Station or SoftAP

#include "ESP32_SMA_MQTT.h"

#define FORMAT_LITTLEFS_IF_FAILED 


//ESP32_SMA_Inverter_App_Config& appConfigInstance = ESP32_SMA_Inverter_App_Config::getInstance();
ESP32_SMA_MQTT& mqttInstance = ESP32_SMA_MQTT::getInstance();


//link to singleton methods
extern void E_formPage() {
  ESP32_SMA_MQTT::getInstance().formPage();
}

extern void E_connectAP() {
  ESP32_SMA_MQTT::getInstance().connectAP();
}

extern void E_handleForm() {
  ESP32_SMA_MQTT::getInstance().handleForm();
}

void ESP32_SMA_MQTT::wifiTime() {
  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;
  const long  gmtOffset_sec = 3600;   // offset seconds, this depends on your time zone (3600 is GMT +1)
  const int   daylightOffset_sec = 3600;  // daylight saving offset seconds
  logD("Setting time via %s, gmt: %d, dst: %d ", config.ntphostname.c_str(), gmtOffset_sec, daylightOffset_sec);


  configTime(gmtOffset_sec, daylightOffset_sec, config.ntphostname.c_str());

  String t = getTime();
  logI("Time %s" , t.c_str());

}


String ESP32_SMA_MQTT::getTime() {
  struct tm timeinfo;
  for (int i=0;i<5;i++) {
    logD(".time.");
    if(getLocalTime(&timeinfo)) {
      char charTime[64];
      strftime(charTime, sizeof(charTime), "%A, %B %d %Y %H:%M:%S", &timeinfo);
      logD("now : %s ", charTime);  
      return String(charTime);
    }
    delay(500);
  }
  logE("failed to obtain time");
  return String("");
}

void ESP32_SMA_MQTT::wifiStartup(){
  // Build Hostname
  logD("wifiStartup()");
  char sapString[20]="";
  snprintf(sapString, 20, "SMA-%08X", ESP.getEfuseMac());
  mqttInstance.sapString = String(sapString);
  logD(mqttInstance.sapString.c_str());

  // Attempt to connect to the AP stored on board, if not, start in SoftAP mode
  WiFi.mode(WIFI_STA);
  delay(2000);

  logD("setHostname");
  WiFi.hostname(mqttInstance.sapString);

#ifdef WIFI_SSID
  //overriding ssid and hostname
  logD("wifi begin with ssid(%s) and password (.......)", WIFI_SSID);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD); 
  for  (int w=0; w<=10 || WiFi.status() != WL_CONNECTED; w++) {
    delay(500);
    logD(".wifi.");
  }
#else
  WiFi.begin();
#endif

  //delay(2000);
  logD("Using config");

  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;
  logD("mqtt topic: %s", config.mqttTopic);
  if (config.mqttTopic == "") 
    config.mqttTopic = mqttInstance.sapString;
  int i = 0;
  while (WiFi.status() != WL_CONNECTED) {
    // Launch smartconfig to reconfigure wifi
    logD(">");
    if (i > 3)
      mySmartConfig();
    i++;
    delay(1000);
  }
  // Success connecting 
  ESP32_SMA_Inverter_App::smartConfig = 0; 
  String hostName = mqttInstance.sapString;
  logW("hostname %s", hostName);
  logW("IP Address: %s", ((String)WiFi.localIP().toString()).c_str());
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);


  wifiTime();


  ESP32_SMA_Inverter_App::webServer.begin();
  ESP32_SMA_Inverter_App::webServer.on("/", E_formPage);
  ESP32_SMA_Inverter_App::webServer.on("/smartconfig", E_connectAP);
  ESP32_SMA_Inverter_App::webServer.on("/postform/", E_handleForm);

  logI("Web Server Running: ");
  
}

// Configure wifi using ESP Smartconfig app on phone
void ESP32_SMA_MQTT::mySmartConfig() {
  logD("smartConfig");
  // Wipe current credentials
  // WiFi.disconnect(true); // deletes the wifi credentials
  
  WiFi.mode(WIFI_STA);
  delay(2000);
  WiFi.begin();
  WiFi.beginSmartConfig();

  //Wait for SmartConfig packet from mobile
  logI("Waiting for SmartESP32_SMA_Inverter_App_Config::config");
  // if no smartconfig received after 5 minutes, reboot and try again
  int count = 0;
  while (!WiFi.smartConfigDone()) {
    delay(500);
    logD(".");
    if (count++ > 600 ) ESP.restart();
  }



  logD("");
  logI("SmartConfig received.");

  //Wait for WiFi to connect to AP
  logW("Waiting for WiFi");
  
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    logD(".");
  }
  logW("IP Address: %s", ((String)WiFi.localIP().toString()).c_str());
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  logW("Restarting in 5 seconds");
  delay(5000);
  ESP.restart();
}

// Use ESP SmartConfig to connect to wifi
void ESP32_SMA_MQTT::connectAP(){
  ESP32_SMA_Inverter_App::webServer.send(200, "text/plain", "Open ESPTouch: Smartconfig App to connect to Wifi Network"); 
  delay(2000);
  mySmartConfig();
  
}


void ESP32_SMA_MQTT::wifiLoop(){
  // Attempt to reconnect to Wifi if disconnected
  if ( WiFi.status() != WL_CONNECTED) {
    
    WiFi.disconnect();
    WiFi.reconnect();
  }
  unsigned long currentMillis = millis();
  // if WiFi is down, try reconnecting
  if ((WiFi.status() != WL_CONNECTED) && (currentMillis - mqttInstance.previousMillis >= mqttInstance.interval)) {
    log_w("Reconnecting to WiFi...\n");
    WiFi.disconnect();
    WiFi.reconnect();
    mqttInstance.previousMillis = currentMillis;
  }
  ESP32_SMA_Inverter_App::webServer.handleClient();  
}

