mrtoy-me/ESP32_SMA-Inverter-MQTT/src/ESP32_SMA_MQTT.cpp
void ESP32_SMA_MQTT::formPage () {
  char tempstr[2048];
  char *responseHTML;
  InverterData& invData = ESP32_SMA_Inverter::getInstance().invData;
  DisplayData& dispData = ESP32_SMA_Inverter::getInstance().dispData;  
  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;
  char fulltopic[100];

  responseHTML = (char *)malloc(sizeof(char)*10000);
  log_w("Connect formpage\n");
  strcpy(responseHTML, "<!DOCTYPE html><html><head>\
                      <title>SMA Inverter</title></head><body>\
                      <style>\
                      table {\
  border-collapse: collapse;\
  width: 100%;\
  font-size: 30px;\
}\
\
table, th, td {\
  border: 1px solid black;\
}\
</style>\
<H1> SMA Bluetooth Configuration</H1>\
<form method=\"post\" enctype=\"application/x-www-form-urlencoded\" action=\"/postform/\">");


  strcat(responseHTML, "<TABLE><TR><TH>Configuration</TH><TH>Setting</TH></TR>\n");
  sprintf(tempstr, "<TR><TD>Inverter Bluetooth Address (Format AA:BB:CC:DD:EE:FF) : </TD><TD> <input type=\"text\" name=\"btaddress\" value=\"%s\"></TD><TR>\n\n",config.smaBTAddress.c_str());
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>MQTT Inverter Password :</TD><TD> <input type=\"text\" name=\"smapw\" value=\"%s\"></TD><TR>\n\n",config.smaInvPass.c_str());
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>MQTT Broker Hostname or IP Address :</TD><TD> <input type=\"text\" name=\"mqttBroker\" value=\"%s\"></TD><TR>\n\n",config.mqttBroker.c_str());
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>MQTT Broker Port : </TD><TD><input type=\"text\" name=\"mqttPort\" value=\"%d\"></TD><TR>\n\n",config.mqttPort);
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>MQTT Broker User :</TD><TD> <input type=\"text\" name=\"mqttUser\" value=\"%s\"></TD><TR>\n\n",config.mqttUser.c_str());
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>MQTT Broker Password :</TD><TD> <input type=\"text\" name=\"mqttPasswd\" value=\"%s\"></TD><TR>\n\n",config.mqttPasswd.c_str());
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>MQTT Topic Preamble:</TD><TD> <input type=\"text\" name=\"mqttTopic\" value=\"%s\"></TD><TR>\n\n",config.mqttTopic.c_str());
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>Inverter scan rate:</TD><TD> <input type=\"text\" name=\"scanRate\" value=\"%d\"></TD><TR>\n\n",config.scanRate);
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>Timezone:</TD><TD> <input type=\"text\" name=\"timezone\" value=\"%s\"></TD><TR>\n\n",config.timezone.c_str());
  strcat(responseHTML, tempstr);
  sprintf(tempstr, "<TR><TD>NTP host:</TD><TD> <input type=\"text\" name=\"ntphostname\" value=\"%s\"></TD><TR>\n\n",config.ntphostname.c_str());
  strcat(responseHTML, tempstr);

  if (config.hassDisc) {
    strcat(responseHTML, "<TR><TD>Home Assistant Auto Discovery:</TD><TD> <input type=\"checkbox\" name=\"hassDisc\" checked ></TD><TR>\n");
    snprintf(fulltopic,sizeof(fulltopic),"homeassistant/sensor/%s-%d/state",config.mqttTopic.c_str(),invData.Serial);
  } else {
    strcat(responseHTML, "<TR><TD>Home Assistant Auto Discovery:</TD><TD> <input type=\"checkbox\" name=\"hassDisc\"></TD><TR>\n");
    snprintf(fulltopic,sizeof(fulltopic),"%s-%d/state",config.mqttTopic.c_str(),invData.Serial);
  }
  strcat(responseHTML, "</TABLE>");
  strcat(responseHTML, "<input type=\"submit\" value=\"Submit\"></form><BR> <A href=\"/smartconfig\">Enable ESP Touch App smart config</A><BR>");


  strcat(responseHTML, "<TABLE><TR><TH>Last Scan</TH><TH>Data</TH>\n");
  
  
  snprintf(tempstr, sizeof(tempstr),
"<tr><td>MQTT Topic</td><td>%s</td></tr>\n\
 <tr><td>BT Signal Strength</td><td>%4.1f %</td></tr>\n\
  <tr><td>Uac</td><td>%15.1f V</td></tr>\n\
 <tr><td>Iac</td><td>%15.1f A</td></tr>\n\
 <tr><td>Pac</td><td>%15.1f kW</td></tr>\n\
 <tr><td>Udc</td><td>String 1: %15.1f V, String 2: %15.1f V</td></tr>\n\
 <tr><td>Idc</td><td>String 1: %15.1f A, String 2: %15.1f A</td></tr>\n\
 <tr><td>Wdc</td><td>String 1: %15.1f kW, String 2: %15.1f kW</td></tr>\n"
 , fulltopic
 , dispData.BTSigStrength
 , dispData.Uac
 , dispData.Iac
 , dispData.Pac
 , dispData.Udc[0], dispData.Udc[1]
 , dispData.Idc[0], dispData.Idc[1]
 , dispData.Udc[0] * dispData.Idc[0] / 1000 , dispData.Udc[1] * dispData.Idc[1] / 1000);

  strcat(responseHTML, tempstr);

  snprintf(tempstr, sizeof(tempstr),
"<tr><td>Frequency</td><td>%5.2f Hz</td></tr>\n\
 <tr><td>E-Today</td><td>%15.1f kWh</td></tr>\n\
 <tr><td>E-Total</td><td>%15.1f kWh</td></tr>\n "
 , dispData.Freq
 , dispData.EToday
 , dispData.ETotal);
  strcat(responseHTML, tempstr);
  strcat(responseHTML,"</TABLE></body></html>\n");
  delay(100);// Serial.print(responseHTML);
  ESP32_SMA_Inverter_App::webServer.send(200, "text/html", responseHTML);

  free(responseHTML);
}

// Function to extract the configuration
void ESP32_SMA_MQTT::handleForm() {
  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;
  
  log_w("Connect handleForm\n");
  if (ESP32_SMA_Inverter_App::webServer.method() != HTTP_POST) {
    ESP32_SMA_Inverter_App::webServer.send(405, "text/plain", "Method Not Allowed");
  } else {
    log_w("POST form was:");
    config.hassDisc = false; 
    for (uint8_t i = 0; i < ESP32_SMA_Inverter_App::webServer.args(); i++) {
      String name = ESP32_SMA_Inverter_App::webServer.argName(i);
      String v = ESP32_SMA_Inverter_App::webServer.arg(i);
      v.trim();
      log_w("%s: %s ",name.c_str(), v.c_str());
      if (name == "mqttBroker") {
        config.mqttBroker = v.c_str();
      } else if (name == "mqttPort") {
        String val = v.c_str();
        config.mqttPort = val.toInt();   
      } else if (name == "mqttUser") {
        config.mqttUser = v.c_str();
      } else if (name == "mqttPasswd") {
        config.mqttPasswd = v.c_str();
      } else if (name == "mqttTopic") {
        config.mqttTopic = v.c_str();
      } else if (name == "btaddress") {
        config.smaBTAddress = v.c_str();
      } else if (name == "smapw") {
        config.smaInvPass = v.c_str();
      } else if (name == "scanRate") {
        config.scanRate = atoi(v.c_str());
      } else if (name == "hassDisc") {
        log_w("%s\n",v.c_str());
        config.hassDisc = true;
      } else if (name == "timezone") {
        config.timezone = v.c_str();
      } else if (name == "ntphostname") {
        config.ntphostname = v.c_str();
      }

