mrtoy-me/ESP32_SMA-Inverter-MQTT/src/ESP32_SMA_MQTT.cpp
    }
    ESP32_SMA_Inverter_App::getInstance().saveConfiguration();
    ESP32_SMA_Inverter_App::getInstance().printFile();
    delay(3000);
    ESP.restart();
  }
}

void ESP32_SMA_MQTT::brokerConnect() {
  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;
  if(config.mqttBroker.length() < 1 ){
    return;
  }
  log_w("Connecting to MQTT Broker");

  ESP32_SMA_Inverter_App::client.setServer(config.mqttBroker.c_str(), config.mqttPort);

  // client.setCallback(callback);
  for(int i =0; i < 3;i++) {
    if ( !ESP32_SMA_Inverter_App::client.connected()){
      log_w("The client %s connects to the mqtt broker %s ", mqttInstance.sapString.c_str(), config.mqttBroker.c_str());
      // If there is a user account
      if(config.mqttUser.length() > 1){
        log_w(" with user/password\n");
        if (ESP32_SMA_Inverter_App::client.connect(mqttInstance.sapString.c_str(),config.mqttUser.c_str(),config.mqttPasswd.c_str())) {
        } else {
          log_e("mqtt connect failed with state %i",ESP32_SMA_Inverter_App::client.state());
          delay(2000);
        }
      } else {
        log_w(" without user/password ");
        if (ESP32_SMA_Inverter_App::client.connect(mqttInstance.sapString.c_str())) {
        } else {
          log_e("mqtt connect failed with state %i", ESP32_SMA_Inverter_App::client.state());
          delay(2000);
        }
      }
    }
  }
}

// Returns true if nighttime
bool ESP32_SMA_MQTT::publishData(){
  InverterData& invData = ESP32_SMA_Inverter::getInstance().invData;
  DisplayData& dispData = ESP32_SMA_Inverter::getInstance().dispData;  
  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;

  if(config.mqttBroker.length() < 1 ){
    return(false);
  }

  brokerConnect();
  if (ESP32_SMA_Inverter_App::client.connected()){
    char theData[2000];
    // char tmpstr[100];


    snprintf(theData,sizeof(theData)-1,
    "{ \"Serial\": %d, \"BTStrength\": %6.2f, \"Uac\": [ %6.2f, %6.2f, %6.2f ], \"Iac\": [ %6.2f, %6.2f, %6.2f ], \"Pac\": %6.2f, \"Udc\": [ %6.2f , %6.2f ], \"Idc\": [ %6.2f , %6.2f ], \"Wdc\": [%6.2f , %6.2f ], \"Freq\": %5.2f, \"EToday\": %6.2f, \"ETotal\": %15.2f, \"InvTemp\": %4.2f, \"DevStatus\": %d, \"GridRelay\": %d }"
 , invData.Serial
 , dispData.BTSigStrength
 , dispData.Uac[0],dispData.Uac[1],dispData.Uac[2]
 , dispData.Iac[0],dispData.Iac[1],dispData.Iac[1]
 , dispData.Pac
 , dispData.Udc[0], dispData.Udc[1]
 , dispData.Idc[0], dispData.Idc[1]
 , dispData.Udc[0] * dispData.Idc[0] / 1000 , dispData.Udc[1] * dispData.Idc[1] / 1000
 , dispData.Freq
 , dispData.EToday
 , dispData.ETotal
 , dispData.InvTemp
 , invData.DevStatus
 , invData.GridRelay
);


    // strcat(theData,"}");
    char topic[100];
    if (config.hassDisc)
      snprintf(topic,sizeof(topic), "homeassistant/sensor/%s-%d/state",config.mqttTopic.c_str(), invData.Serial);
    else
      snprintf(topic,sizeof(topic), "%s-%d/state",config.mqttTopic.c_str(), invData.Serial);
    logI(topic);
    logI(" = ");
    logI("%s\n",theData);
    int len = strlen(theData);
    ESP32_SMA_Inverter_App::client.beginPublish(topic,len,false);
    if (ESP32_SMA_Inverter_App::client.print(theData))
      logI("Published\n");
    else
      logW("Failed Publish\n");
    ESP32_SMA_Inverter_App::client.endPublish();
  }
  // If Power is zero, it's night time
  if (dispData.Pac > 0) 
    return(false);
  else
    return(true);
}

void ESP32_SMA_MQTT::logViaMQTT(const char *logStr){
  InverterData& invData = ESP32_SMA_Inverter::getInstance().invData;
  DisplayData& dispData = ESP32_SMA_Inverter::getInstance().dispData;  
  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;

  char tmp[1000];
  if(config.mqttBroker.length() < 1 ){
    return;
  }
  snprintf(tmp,sizeof(tmp),"{ \"Log\": \"%s\" }",logStr);
  brokerConnect();
  
  if (ESP32_SMA_Inverter_App::client.connected()){

    // strcat(theData,"}");
    char topic[100];
    snprintf(topic,sizeof(topic), "homeassistant/sensor/%s-%d/state",config.mqttTopic.c_str(), invData.Serial);
    logI(topic);
    logI(" = ");
    logI(" %s\n",tmp);
    int len = strlen(tmp);
    ESP32_SMA_Inverter_App::client.beginPublish(topic,len,false);
    if (ESP32_SMA_Inverter_App::client.print(tmp))
      logI("Published\n");
    else
      logW("Failed Publish\n");
    ESP32_SMA_Inverter_App::client.endPublish();
  }
  
}


// Set up the topics in home assistant
void ESP32_SMA_MQTT::hassAutoDiscover(int timeout){

  InverterData& invData = ESP32_SMA_Inverter::getInstance().invData;
  DisplayData& dispData = ESP32_SMA_Inverter::getInstance().dispData;  
  AppConfig& config = ESP32_SMA_Inverter_App::getInstance().appConfig;

  char tmpstr[1000];
  char topic[30];
  brokerConnect();
  
  snprintf(topic,sizeof(topic)-1, "%s-%d",config.mqttTopic.c_str(), invData.Serial);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"power\", \"name\": \"%s AC Power\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"kW\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Pac }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Pac",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"current\", \"name\": \"%s A Phase Current\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"A\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Iac[0] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"IacA",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"current\", \"name\": \"%s B Phase Current\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"A\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Iac[1] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"IacB",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"current\", \"name\": \"%s C Phase Current\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"A\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Iac[2] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"IacC",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"voltage\", \"name\": \"%s A Phase Voltage\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"V\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Uac[0] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"UacA",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"voltage\", \"name\": \"%s B Phase Voltage\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"V\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Uac[1] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"UacB",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"voltage\", \"name\": \"%s C Phase Voltage\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"V\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Uac[2] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"UacC",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"frequency\", \"name\": \"%s AC Frequency\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"Hz\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Freq }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Freq",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"power\", \"name\": \"%s DC Power (String 1)\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"kW\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Wdc[0] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Wdc1",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"power\", \"name\": \"%s DC Power (String 2)\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"kW\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Wdc[1] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Wdc2",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"voltage\", \"name\": \"%s DC Voltage (String 1)\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"V\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Udc[0] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Udc1",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"voltage\", \"name\": \"%s DC Voltage (String 2)\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"V\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Udc[1] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Udc2",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"current\", \"name\": \"%s DC Current (String 1)\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"A\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Idc[0] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Idc1",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"current\", \"name\": \"%s DC Current (String 2)\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"A\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Idc[1] }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Idc2",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"energy\", \"name\": \"%s kWh Today\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"kWh\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.EToday }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"EToday",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"energy\", \"name\": \"%s kWh Total\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"kWh\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.ETotal }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"ETotal",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"device_class\": \"temperature\", \"name\": \"%s Inverter Temperature\" , \"state_topic\": \"homeassistant/sensor/%s/state\", \"unit_of_measurement\": \"C\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.InvTemp }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"InvTemp",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"name\": \"%s Device Status\" , \"state_topic\": \"homeassistant/sensor/%s/state\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.DevStatus }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"DevStatus",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"name\": \"%s Grid Relay Status\" , \"state_topic\": \"homeassistant/sensor/%s/state\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.GridRelay }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"GridRelay",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"name\": \"%s Bluetooth\" , \"state_topic\": \"homeassistant/sensor/%s/state\",\"unit_of_measurement\": \"%%\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.BTStrength }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Bluetooth",tmpstr);
  snprintf(tmpstr,sizeof(tmpstr)-1, "{\"name\": \"%s Log\" , \"state_topic\": \"homeassistant/sensor/%s/state\",  \"expire_after\": %d, \"value_template\": \"{{ value_json.Log }}\" }",topic,topic,timeout);
  sendLongMQTT(topic,"Log",tmpstr);
}

void ESP32_SMA_MQTT::sendLongMQTT(const char *topic, const char *postscript, const char *msg){
  int len = strlen(msg);
  char tmpstr[100];
  snprintf(tmpstr,sizeof(tmpstr),"homeassistant/sensor/%s-%s/config",topic,postscript);
  ESP32_SMA_Inverter_App::client.beginPublish(tmpstr,len,true);
  logI("%s -> %s... ",tmpstr,msg);
   if (ESP32_SMA_Inverter_App::client.print(msg))
      logI("Published\n");
    else
      logW("Failed Publish\n");
    ESP32_SMA_Inverter_App::client.endPublish();
    delay(200);
}